---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType
source: html/797dd02e-b6eb-e8b5-0ec8-febab80c0d8a.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurfaceType

Analytical surface types.

## Syntax (C#)
```csharp
public enum EnergyAnalysisSurfaceType
```